<?php
//define your token


define ( "TOKEN", "sharen_wx" );
define ( "dataPsw", "85bcc87cc3" );

define ( "cutOffLine", "===============\n" );
define ( "hello_world", "正义与邪恶的较量，从来都没有停止过，揣测与推理，诱导与雄辩，蛛丝马迹与精心布局，或许少了察言观色，却可以面不改色，这里是恐怖笼罩的城市，回复0开启一段智力之旅" );
define ( "intro_10020", "等待发牌" );
define ( "intro_10021", "杀手杀人" );
define ( "intro_10022", "警察验人" );
define ( "intro_10023", "投票和自由发言阶段" );
define ( "intro_100063", "人民警察已经全部牺牲，小镇期待重生" );
define ( "intro_100064", "人民的眼睛是雪亮的，所有杀手都被绳之以法，小镇恢复了往日的宁静" );
define ( "intro_100065", "这里注定是一个《恐怖笼罩的小镇》,明天醒来，不知哪位朋友又将离去" );

define ( "user_sign_str", "ABCDEFGHIJKLMNOPQRSTUVWXYZ" );
define ( "help_room_join", "输入:[拥抱]+号码可加入小镇，直接输入：[勾引] 将可创建新小镇,快速加入输入两个拥抱:[拥抱][拥抱]" );
define ( "help_basic", "加入杀人游戏:\n关注微信帐号sharenyouxi_wx,获取二维码请输入：杀人游戏\n
加入小镇：\n输入:[拥抱]+号码可加入小镇，直接输入：[勾引] 将可创建新小镇,快速加入输入两个拥抱:[拥抱][拥抱]\n
游戏:
游戏分为4个阶段：
一、等待发牌阶段:一个小镇中有一定数量的成员输入[OK]确认开始后便可发牌
二、杀手杀人阶段:杀手输入编号可杀人，被指定成员即死亡，查看所有人编号，请输入:人,该阶段发言将被作匿名处理，杀手向自己同伴发消息可输入[嘘]+发言
三、警察验人阶段:杀手杀人成功后警察可以输入编号验人，系统将回复该名成员是否凶手，查看所有人编号，请输入:人,该阶段发言将被作匿名处理，警察向自己搭档发消息可输入[嘘]+发言
四、投票阶段:宣布被害者后，所有人输入[OK]开始投票，当所有人均投票之后最高得票者将被判决，判决之后有三种情况：1）全部杀手死亡或被判决，游戏结束，警察和平民赢；2）全部警察死亡，游戏结束，杀手赢；3）杀手和警察均至少还有一名成员，游戏继续，回到一、杀手杀人阶段

查看房间号:请输入[房] (注：命令包含两边英文中括号)
查看我的信息:请输入[我] (注：命令包含两边英文中括号)

注：为了不主动干扰用户，杀人游戏并不会实时发布信息，游戏故事只会随着每位玩家的参与而发展，同时建议已经开始游戏的玩家经常回来查看消息，如不想发言可直接回复0，为了更好控制游戏节奏，可约上熟悉好友同时玩" );

?>